In [1]:
import numpy as np
import pandas as pd
df = pd.read_excel('hiring.xlsx')
df

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

**Filling null values with mean of test_score**

In [2]:
df.test_score.fillna(df.test_score.mean(), inplace=True)
df.test_score

0     8.000000
1     8.000000
2     6.000000
3    10.000000
4     9.000000
5     7.000000
6     7.857143
7     7.000000
Name: test_score, dtype: float64

**Converting words into numbers**

In [5]:
df.experience.fillna('zero', inplace=True)
from word2number import w2n
df.experience = df.experience.apply(w2n.word_to_num)

In [6]:
df

   experience  test_score  interview_score  salary
0           0    8.000000                9   50000
1           0    8.000000                6   45000
2           5    6.000000                7   60000
3           2   10.000000               10   65000
4           7    9.000000                6   70000
5           3    7.000000               10   62000
6          10    7.857143                7   72000
7          11    7.000000                8   80000

**Creating our regression model**

In [9]:
from sklearn.linear_model import LinearRegression
model=LinearRegression()
model.fit(df.drop('salary', axis='columns'), df.salary)

LinearRegression()

In [11]:
model.predict([[2,9,6]])

array([53290.89255945])

In [12]:
model.predict([[12,10,10]])

array([92268.07227784])